#pragma once


void zad_1(float x, float c, float a);
/*
 Написать формулу, которая подсчитывает значение по определенной формуле
*/


void zad_2(int S_);
/*
Тело движется по закону S = t^3 – 3t^2 + 2. Вычислить скорость тела в момент времени t.Значение t ввести с клавиатуры.
*/

void zad_3(double a, double b, double c);
/*Даны вещественные числа а, b, с, а≠0. Решить уравнение аx^2+bx+c = 0. Учесть возможность равенства корней.*/



double zad_4(int kod, double t);
/*Написать программу, которая по коду города и длительности переговоров вычисляет их стоимость и результат выводит на экран:
 Одесса-код 048, 15грн; Киев-код 044,18грн; Харьков-код 046, 13грн; Винница-код 045, 11грн.В гривнах указана стоимость звонка в 1 минуту.
*/

void zad_5(int* bin, int N);
/*
Натуральное число из n цифр является число Армстронга, если сумма его цифр возведенных в n-ую
равна самому числу. Необходимо получить все эти числа, состоящие из четырех цифр.
*/

void zad_6(int* a, int b);
/*
Дано целое число в двоичной системе счисления. Составить программу перевода этого числа в десятичную систему счисления
*/



void zad_7(int I, int J);
/*
Cформируйте массив L(I,J) с помощью датчика случайных чисел от -10 до 10. 
Увеличить каждый элемент массива в 3 раза и поменяйте знак на противоположный. Массив выведите на экран в виде таблицы.
*/